; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types
        car - object
        location - object )

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))


   (:action board
       :parameters (?car - car ?loc - location)
       :precondition  (and  (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car - car  ?loc - location)
       :precondition  (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
;; cars=10, locations=10, out_folder=training/easy, instance_id=52, seed=82

(define (problem ferry-52)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc3)
    (at car1 loc8)
    (at car2 loc9)
    (at car3 loc5)
    (at car4 loc3)
    (at car5 loc3)
    (at car6 loc5)
    (at car7 loc3)
    (at car8 loc1)
    (at car9 loc7)
    (at car10 loc8)
)
 (:goal  (and (at car1 loc2)
   (at car2 loc4)
   (at car3 loc6)
   (at car4 loc10)
   (at car5 loc4)
   (at car6 loc2)
   (at car7 loc9)
   (at car8 loc3)
   (at car9 loc6)
   (at car10 loc6))))

; plan
1. (board car4 loc3)
   deleted: (at car4 loc3) (empty-ferry)
   added: (on car4)
   goals met: 0 of 10
2. (sail loc3 loc10)
   deleted: (at-ferry loc3)
   added: (at-ferry loc10)
   goals met: 0 of 10
3. (debark car4 loc10)
   deleted: (on car4)
   added: (at car4 loc10) (empty-ferry)
   goals met: 1 of 10
4. (sail loc10 loc5)
   deleted: (at-ferry loc10)
   added: (at-ferry loc5)
   goals met: 1 of 10
5. (board car6 loc5)
   deleted: (at car6 loc5) (empty-ferry)
   added: (on car6)
   goals met: 1 of 10
6. (sail loc5 loc2)
   deleted: (at-ferry loc5)
   added: (at-ferry loc2)
   goals met: 1 of 10
7. (debark car6 loc2)
   deleted: (on car6)
   added: (at car6 loc2) (empty-ferry)
   goals met: 2 of 10
8. (sail loc2 loc8)
   deleted: (at-ferry loc2)
   added: (at-ferry loc8)
   goals met: 2 of 10
9. (board car1 loc8)
   deleted: (at car1 loc8) (empty-ferry)
   added: (on car1)
   goals met: 2 of 10
10. (sail loc8 loc2)
   deleted: (at-ferry loc8)
   added: (at-ferry loc2)
   goals met: 2 of 10
11. (debark car1 loc2)
   deleted: (on car1)
   added: (at car1 loc2) (empty-ferry)
   goals met: 3 of 10
12. (sail loc2 loc7)
   deleted: (at-ferry loc2)
   added: (at-ferry loc7)
   goals met: 3 of 10
13. (board car9 loc7)
   deleted: (at car9 loc7) (empty-ferry)
   added: (on car9)
   goals met: 3 of 10
14. (sail loc7 loc6)
   deleted: (at-ferry loc7)
   added: (at-ferry loc6)
   goals met: 3 of 10
15. (debark car9 loc6)
   deleted: (on car9)
   added: (at car9 loc6) (empty-ferry)
   goals met: 4 of 10
16. (sail loc6 loc8)
   deleted: (at-ferry loc6)
   added: (at-ferry loc8)
   goals met: 4 of 10
17. (board car10 loc8)
   deleted: (at car10 loc8) (empty-ferry)
   added: (on car10)
   goals met: 4 of 10
18. (sail loc8 loc6)
   deleted: (at-ferry loc8)
   added: (at-ferry loc6)
   goals met: 4 of 10
19. (debark car10 loc6)
   deleted: (on car10)
   added: (at car10 loc6) (empty-ferry)
   goals met: 5 of 10
20. (sail loc6 loc5)
   deleted: (at-ferry loc6)
   added: (at-ferry loc5)
   goals met: 5 of 10
21. (board car3 loc5)
   deleted: (at car3 loc5) (empty-ferry)
   added: (on car3)
   goals met: 5 of 10
22. (sail loc5 loc6)
   deleted: (at-ferry loc5)
   added: (at-ferry loc6)
   goals met: 5 of 10
23. (debark car3 loc6)
   deleted: (on car3)
   added: (at car3 loc6) (empty-ferry)
   goals met: 6 of 10
24. (sail loc6 loc1)
   deleted: (at-ferry loc6)
   added: (at-ferry loc1)
   goals met: 6 of 10
25. (board car8 loc1)
   deleted: (at car8 loc1) (empty-ferry)
   added: (on car8)
   goals met: 6 of 10
26. (sail loc1 loc3)
   deleted: (at-ferry loc1)
   added: (at-ferry loc3)
   goals met: 6 of 10
27. (debark car8 loc3)
   deleted: (on car8)
   added: (at car8 loc3) (empty-ferry)
   goals met: 7 of 10
28. (board car7 loc3)
   deleted: (at car7 loc3) (empty-ferry)
   added: (on car7)
   goals met: 7 of 10
29. (sail loc3 loc9)
   deleted: (at-ferry loc3)
   added: (at-ferry loc9)
   goals met: 7 of 10
30. (debark car7 loc9)
   deleted: (on car7)
   added: (at car7 loc9) (empty-ferry)
   goals met: 8 of 10
31. (board car2 loc9)
   deleted: (at car2 loc9) (empty-ferry)
   added: (on car2)
   goals met: 8 of 10
32. (sail loc9 loc4)
   deleted: (at-ferry loc9)
   added: (at-ferry loc4)
   goals met: 8 of 10
33. (debark car2 loc4)
   deleted: (on car2)
   added: (at car2 loc4) (empty-ferry)
   goals met: 9 of 10
34. (sail loc4 loc3)
   deleted: (at-ferry loc4)
   added: (at-ferry loc3)
   goals met: 9 of 10
35. (board car5 loc3)
   deleted: (at car5 loc3) (empty-ferry)
   added: (on car5)
   goals met: 9 of 10
36. (sail loc3 loc4)
   deleted: (at-ferry loc3)
   added: (at-ferry loc4)
   goals met: 9 of 10
37. (debark car5 loc4)
   deleted: (on car5)
   added: (at car5 loc4) (empty-ferry)
   goals met: 10 of 10
